INSERT INTO "article_article"("id", "title", "slug", "summary", "published_date", "created_date", "updated_date", "content") VALUES (1, '背影', 'by', '《背影》是中国现代作家朱自清于1925年创作的回忆性散文。这篇散文叙述作者离开南京去北京大学，父亲送他到浦口火车站，照料他上车，并替他买橘子的情形，而作者印象最深刻的是父亲替他买橘子时在月台爬上攀下时的背影。全文语言既忠实朴素又典雅文质，作者运用白描及侧面烘托等手法，把父亲对儿子的爱，表达得深刻细腻，真挚感动，从平凡的事件中，呈现出父亲对儿子的关怀和爱护。', '2024-08-17 05:34:00', '2024-08-17 05:35:10.361547', '2024-08-17 05:35:10.361547', '我與父親不相見已二年餘了，我最不能忘記的是他的背影。那年
冬天，祖母死了，父親的差使也交卸了，正是禍不單行的日子，我從
北京到徐州，打算跟着父親奔喪回家。到徐州見着父親，看見滿院狼
藉的東西，又想起祖母，不禁簌簌地流下眼淚。父親說：「事已如此，
不必難過，好在天無絕人之路！」
 回家變賣典質，父親還了虧空；又借錢辦了喪事。這些日子，家
中光景很是慘澹，一半為了喪事，一半為了父親賦閒。喪事完畢，父
親要到南京謀事，我也要回北京唸書，我們便同行。
 到南京時，有朋友約去遊逛，勾留了一日；第二日上午便須渡江
到浦口，下午上車北去。父親因為事忙，本已說定不送我，叫旅館裏
一個熟識的茶房陪我同去。他再三囑咐茶房，甚是仔細。但他終於不
放心，怕茶房不妥帖；頗躊躇了一會。其實我那年已二十歲，北京已
來往過兩三次，是沒有甚麼要緊的了。他躊躇了一會，終於決定還是
自己送我去。我兩三回勸他不必去；他只說：「不要緊，他們去不好！」
 我們過了江，進了車站。我買票，他忙着照顧行李。行李太多了，
得向腳夫行些小費，才可過去。他便又忙着和他們講價錢。我那時真
是聰明過分，總覺他說話不大漂亮，非自己插嘴不可。但他終於講定
了價錢；就送我上車。他給我揀定了靠車門的一張椅子；我將他給我
做的紫毛大衣鋪好座位。他囑我路上小心，夜裏要警醒些，不要受涼。
又囑託茶房好好照應我。我心裏暗笑他的迂；他們只認得錢，託他們
直是白託！而且我這樣大年紀的人，難道還不能料理自己麼？唉，我
現在想想，那時真是太聰明了！');
INSERT INTO "article_article"("id", "title", "slug", "summary", "published_date", "created_date", "updated_date", "content") VALUES (2, '活着', 'hz', '《活着》是中国当代作家余华创作的长篇虚构小说，首次发表于《收获》1992年第6期。', '2024-08-17 05:39:00', '2024-08-17 05:43:31.855221', '2024-08-17 05:43:31.855221', '我有时候觉得，生活就是一种非常漫长的等待，我们每个人都在等待着什么，只是等待的东西不同罢了。对于我来说，我在等待的是一场没有尽头的梦境，我在等待着自己变成一个与过去完全不同的人。');
INSERT INTO "article_article"("id", "title", "slug", "summary", "published_date", "created_date", "updated_date", "content") VALUES (3, '捕蛇者说', 'bszs', '柳宗元《捕蛇者说》原文、赏析和鉴赏', '2024-08-17 05:44:00', '2024-08-17 05:44:37.431531', '2024-08-17 05:44:37.431531', '永州之野产异蛇，黑质而白章。触草木，尽死;以啮人，无御之者。然得而腊之以为饵，可以已大风、挛踠、瘘、疠，去死肌，杀三虫。其始，太医以王命聚之，岁赋其二;募有能捕之者，当其租入。永之人争奔走焉。

有蒋氏者，专其利三世矣。问之，则曰：“吾祖死于是，吾父死于是，今吾嗣为之十二年，几死者数矣。”言之，貌若甚戚者。余悲之，且曰：“若毒之乎?余将告于莅事者，更若役，复若赋，则何如?”

蒋氏大戚，汪然出涕曰：“君将哀而生之乎?则吾斯役之不幸，未若复吾赋不幸之甚也! 向吾不为斯役，则久已病矣。自吾氏三世居是乡，积于今六十岁矣，而乡邻之生日蹙。殚其地之出，竭其庐之入，号呼而转徙，饥渴而顿踣，触风雨，犯寒暑，呼嘘毒疠，往往而死者相藉也。曩与吾祖居者，今其室十无一焉;与吾父居者，今其室十无二三焉;与吾居十二年者，今其室十无四五焉。非死而徙尔，而吾以捕蛇独存。悍吏之来吾乡，叫嚣乎东西，隳突乎南北，哗然而骇者，虽鸡狗不得宁焉。吾恂恂而起，视其缶，而吾蛇尚存，则弛然而卧。谨食之，时而献焉。退而甘食其土之有，以尽吾齿。盖一岁之犯死者二焉，其余则熙熙而乐，岂若吾乡邻之旦旦有是哉!今虽死乎此，比吾乡邻之死则已后矣，又安敢毒耶?”

余闻而愈悲。孔子曰：“苛政猛于虎也。”吾尝疑乎是。今以蒋氏观之，犹信。呜呼! 孰知赋敛之毒，有甚是蛇者乎!故为之说，以俟夫观人风者得焉。');
INSERT INTO "article_article"("id", "title", "slug", "summary", "published_date", "created_date", "updated_date", "content") VALUES (4, '早发白帝城', 'zfbdc', '朝辞白帝彩云间...', '2024-08-17 05:45:00', '2024-08-17 05:45:28.870242', '2024-08-17 05:46:37.846652', '朝辞白帝彩云间，千里江陵一日还。

两岸猿声啼不住，轻舟已过万重山。');
INSERT INTO "article_article"("id", "title", "slug", "summary", "published_date", "created_date", "updated_date", "content") VALUES (5, '闻王昌龄左迁龙标遥有此寄', 'wwcl', '杨花落尽子规啼...', '2024-08-17 05:46:00', '2024-08-17 05:47:40.210365', '2024-08-17 05:47:40.210365', '杨花落尽子规啼，闻道龙标过五溪。

我寄愁心与明月，随风直到夜郎西。');
INSERT INTO "article_article"("id", "title", "slug", "summary", "published_date", "created_date", "updated_date", "content") VALUES (6, '峨眉山月歌', 'emsyg', '峨眉山月半轮秋...', '2024-08-17 05:47:00', '2024-08-17 05:48:11.490654', '2024-08-17 05:48:11.490654', '峨眉山月半轮秋，影入平羌江水流。

夜发清溪向三峡，思君不见下渝州。');
INSERT INTO "article_article"("id", "title", "slug", "summary", "published_date", "created_date", "updated_date", "content") VALUES (7, 'MathJax 支持', 'mathjax', '通过 MathJax 选择性地支持数学方程式。', '2024-08-17 06:43:00', '2024-08-17 06:45:54.219068', '2024-08-17 07:33:29.925264', '### 内联方程式
内联方程由 \\( 和 \\) 分隔。 例如，要渲染以下内联方程 ∫xdx=x22+C
，您可以编写以下内容：\\( \int x dx = \frac{x^2}{2} + C \\)

### 块方程式
1. 块方程由 `\\[` 和 `\\]` 分隔。 渲染以下等式

\\[ \mu = \frac{1}{N} \sum_{i=0} x_i \\]

2. 另一种整行公式（displayed）的写法是，用一对紧挨的两个美元符号`$$`包裹
这是一个整行公式：

$$
\sum_{i=0}^n i^2 = \frac{(n^2+n)(2n+1)}{6}
$$

### 代码块支持
```python
#!/usr/bin/env python
"""Django''s command-line utility for administrative tasks."""
import os
import sys


def main():
    """Run administrative tasks."""
    os.environ.setdefault(''DJANGO_SETTINGS_MODULE'', ''PureBlog.settings'')
    try:
        from django.core.management import execute_from_command_line
    except ImportError as exc:
        raise ImportError(
            "Couldn''t import Django. Are you sure it''s installed and "
            "available on your PYTHONPATH environment variable? Did you "
            "forget to activate a virtual environment?"
        ) from exc
    execute_from_command_line(sys.argv)


if __name__ == ''__main__'':
    main()

```

### Markdown 表格
要添加表，请使用三个或多个连字符（---）创建每列的标题，并使用管道（|）分隔每列。您可以选择在表的任一端添加管道。

| Syntax      | Description | Test Text     |
| :---        |    :----:   |          ---: |
| Header      | Title       | Here''s this   |
| Paragraph   | Text        | And more      |

### 自动网址链接
许多Markdown处理器会自动将URL转换为链接。这意味着如果您输入，即使您未使用方括号，您的Markdown处理器也会自动将其转换为链接。
呈现的输出如下所示：http://www.example.com

### 使用表情符号简码
一些Markdown应用程序允许您通过键入表情符号短代码来插入表情符号。这些以冒号开头和结尾，并包含表情符号的名称。
去露营了！ :tent: 很快回来。
真好笑！ :joy:
呈现的输出如下所示：
去露营了！⛺很快回来。
真好笑！😂
注意：您可以使用此表情符号简码列表，但请记住，表情符号简码因应用程序而异。有关更多信息，请参阅Markdown应用程序的文档。');
